In [46]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

df = pd.read_csv('sample_file_with_index.csv', index_col='i')
df

   a  b   c
i
1  4  7  10
2  5  8  11
3  6  9  12

In [47]:
candidate = pd.DataFrame({'candidate_name': ['John Doe', 'Lily Bush', 'Peter Drucker','Jane Doe']})
candidate

  candidate_name
0       John Doe
1      Lily Bush
2  Peter Drucker
3       Jane Doe

In [48]:
employee = pd.DataFrame({'employee_name': ['John Doe', 'Jane Doe', 'Michael Scott', 'Jack Sparrow']})
employee

   employee_name
0       John Doe
1       Jane Doe
2  Michael Scott
3   Jack Sparrow

## Inner Join

Inner join produces a data set that includes rows from the left table which have matching rows from the right table.

In [50]:
candidate.merge(employee, left_on='candidate_name', right_on='employee_name')

  candidate_name employee_name
0       John Doe      John Doe
1       Jane Doe      Jane Doe

## Left Join

Left join produces a dataset that includes all rows from the left table and the matching rows from the right table.

In [51]:
candidate.merge(employee, left_on='candidate_name', right_on='employee_name', how='left')

  candidate_name employee_name
0       John Doe      John Doe
1      Lily Bush           NaN
2  Peter Drucker           NaN
3       Jane Doe      Jane Doe

Get the rows that available only in the left table but not in the right table.

In [52]:
candidate[~candidate.candidate_name.isin(employee.employee_name)]

  candidate_name
1      Lily Bush
2  Peter Drucker

## Right Join

In [54]:
candidate.merge(employee, left_on='candidate_name', right_on='employee_name', how='right')

  candidate_name  employee_name
0       John Doe       John Doe
1       Jane Doe       Jane Doe
2            NaN  Michael Scott
3            NaN   Jack Sparrow

In [55]:
employee[~employee.employee_name.isin(candidate.candidate_name)]

   employee_name
2  Michael Scott
3   Jack Sparrow

## Full Outer Join

In [68]:
candidate.merge(employee, left_on='candidate_name', right_on='employee_name', how='outer')

  candidate_name  employee_name
0       John Doe       John Doe
1      Lily Bush            NaN
2  Peter Drucker            NaN
3       Jane Doe       Jane Doe
4            NaN  Michael Scott
5            NaN   Jack Sparrow

In [71]:
candidate.merge(employee, left_on='candidate_name', right_on='employee_name', how='outer', indicator=True)\
         .query('_merge != "both"')\
         .drop(columns=['_merge'])

  candidate_name  employee_name
1      Lily Bush            NaN
2  Peter Drucker            NaN
4            NaN  Michael Scott
5            NaN   Jack Sparrow